app/Controllers/CAutenticacion.php

    public function iniciarSesion()
    {
        $UsuarioModel = new UsuarioModel();

        $email = $this->request->getPost('email');
        $contraseña =($this->request->getPost('contraseña'));

        $informacion_usuario = $UsuarioModel->ObtenerUsuarioEmail($email);

        if (!$informacion_usuario || !password_verify($contraseña, $informacion_usuario['contraseña'])) {
            session()->setFlashdata('fail', 'Correo electrónico o contraseña incorrectos');
            return redirect()->to('autenticacion/login');
        }else {
            $id_usuario = $informacion_usuario['id_usuario'];
            session()->set('Tipo', 'Usuario');
            session()->set('userData', $UsuarioModel->find($id_usuario));
---
SELECT *
FROM `usuarios`
WHERE `usuarios`.`id_usuario` = '1'