app/Controllers/CMedicion.php

INSERT INTO `medicion` (`id_planta`, `humedad`, `id_usuario`, `fecha`) VALUES ('20', '58', '2', '2024-11-10 18:54:46')
---
    public function recibirMedicion()
    {
        // Recibir datos de la solicitud POST
        $id_planta = $this->request->getPost('id_planta');
        $humedad = $this->request->getPost('humedad');
        $id_usuario = $this->request->getPost('id_usuario');

        // Validar los datos (por ejemplo, asegurarse de que la humedad esté en el rango adecuado)
        if (is_numeric($humedad) && $humedad >= 0 && $humedad <= 100) {
            // Guardar la medición en la base de datos
            $medicionModel = new MedicionModel();
            $data = [
                'id_planta' => $id_planta,
                'humedad' => $humedad,
                'id_usuario' => $id_usuario,
                'fecha' => date('Y-m-d H:i:s')
            ];
            $medicionModel->save($data);