app/Models/LecturaModel.php

SELECT `lh`.`fecha_hora`, `lh`.`nivel_humedad`
FROM `lecturas_humedad` `lh`
JOIN `configuracion_riego` `cr` ON `lh`.`id_dispositivo` = `cr`.`id_dispositivo`
WHERE `cr`.`id_planta` = '105'
ORDER BY `lh`.`fecha_hora` DESC
---
    public function obtenerLecturasPorPlanta($id_planta)
    {
    return $this->db->table('lecturas_humedad lh')
                    ->select('lh.fecha_hora, lh.nivel_humedad') // Selecciona solo las columnas deseadas
                    ->join('configuracion_riego cr', 'lh.id_dispositivo = cr.id_dispositivo')
                    ->where('cr.id_planta', $id_planta)
                    ->orderBy('lh.fecha_hora', 'DESC')
                    ->get()
                    ->getResultArray();