app/Models/PlantaModel.php

SELECT *
FROM `planta`
WHERE `id_planta` = '105'
AND `id_usuario` = '3'
 LIMIT 1
---
    public function obtenerPlantaPorIdYUsuario($id_planta, $id_usuario)
    {
        return $this->where('id_planta', $id_planta)
                    ->where('id_usuario', $id_usuario)
                    ->first();

SELECT `planta`.*, `ubicacion`.`lugar_planta`
FROM `planta`
JOIN `ubicacion` ON `planta`.`id_ubicacion` = `ubicacion`.`id_ubicacion`
WHERE `planta`.`id_usuario` = '3'
---
    public function obtenerPlantasConUbicacion($id_usuario)
    {
        return $this->select('planta.*, ubicacion.lugar_planta')
                    ->join('ubicacion', 'planta.id_ubicacion = ubicacion.id_ubicacion')
                    ->where('planta.id_usuario', $id_usuario)
                    ->findAll();