app/Models/UsuarioModel.php

        public function ObtenerUsuarioEmail($email)
        {
            return $this->where('email', $email)->first();
---
SELECT *
FROM `usuarios`
WHERE `email` = 'benjaoviedo@gmail.com'
 LIMIT 1